АлогистикТест2/src/Documents/алк_АктОТКПоПакетам/алк_АктОТКПоПакетам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_АктОТКПоПакетам</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.алк_ДанныеАктаОТК</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОТК</name>
    <type>
      <types>CatalogRef.алк_ШаблоныОТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пакеты</name>
    <attributes>
      <name>Деффект</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ДанныеАктаОТК/алк_ДанныеАктаОТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ДанныеАктаОТК</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СсылочноеЗначение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Влажность</types>
      <types>CatalogRef.Породы</types>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
      <types>CatalogRef.Длины</types>
      <types>CatalogRef.Сорта</types>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.алк_ШаблоныОТК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Колонка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Documents/алк_АктОТКПоПакетам/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		// регистр алк_ДанныеАктаОТК 
		Движения.алк_ДанныеАктаОТК.Записывать = Истина;
		Если НЕ ЭтотОбъект.ПометкаУдаления Тогда	
			Для Каждого ТекСтрокаПакеты Из Пакеты Цикл
				Движение = Движения.алк_ДанныеАктаОТК.Добавить();
				Движение.Период = Дата;
				Движение.Шаблон = ШаблонОТК;
				Движение.Строка = ТекСтрокаПакеты.Деффект;
				Движение.СерийныйНомер = ТекСтрокаПакеты.СерийныйНомер; 
				Движение.Значение = 1;
			КонецЦикла;		
		Иначе	
			Движения.алк_ДанныеАктаОТК.Прочитать();
			Движения.алк_ДанныеАктаОТК.УстановитьАктивность(НЕ ЭтотОбъект.ПометкаУдаления);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
